---
kind: method
id: M:Autodesk.Revit.DB.DWGImportOptions.SetLineWeights(System.Collections.Generic.IList{System.Int32})
source: html/c1534476-52c3-1f61-b469-e988632ac13f.htm
---
# Autodesk.Revit.DB.DWGImportOptions.SetLineWeights Method

Set array of line weights.

## Syntax (C#)
```csharp
public void SetLineWeights(
	IList<int> lineWeight
)
```

## Parameters
- **lineWeight** (`System.Collections.Generic.IList < Int32 >`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null